Repository: nurkamol/my-account-menu-builder-for-woocommerce
Catalog: languages/*-account-menu-builder-for-woocommerce-*.po
Languages: ar, ja

source: Account Details
ar: تفاصيل الحساب
ja: アカウント詳細

source: Add Item
ar: إضافة عنصر
ja: 項目を追加

source: Add Menu Item
ar: إضافة عنصر قائمة
ja: メニュー項目を追加

source: Add Separator
ar: إضافة فاصل
ja: 区切り線を追加

source: Addresses
ar: العناوين
ja: 住所

source: Author Name
ar: اسم المؤلف
ja: 著者名

source: Author URL
ar: رابط المؤلف
ja: 著者URL

source: Badge Text
ar: نص الشارة
ja: バッジテキスト

source: Cancel
ar: إلغاء
ja: キャンセル

source: Custom CSS Class
ar: فئة CSS مخصصة
ja: カスタムCSSクラス

source: Dashboard
ar: لوحة التحكم
ja: ダッシュボード

source: Delete this menu item?
ar: حذف عنصر القائمة هذا؟
ja: このメニュー項目を削除しますか？

source: Description / Subtitle
ar: الوصف / العنوان الفرعي
ja: 説明 / サブタイトル

source: Download Count
ar: عدد التنزيلات
ja: ダウンロード数

source: Downloads
ar: التنزيلات
ja: ダウンロード

source: Drag items to reorder
ar: اسحب العناصر لإعادة الترتيب
ja: ドラッグして並べ替え

source: Dynamic Count
ar: عداد ديناميكي
ja: 動的カウンター

source: Enable White Label
ar: تفعيل العلامة البيضاء
ja: ホワイトラベルを有効化

source: Enabled
ar: مفعّل
ja: 有効

source: Endpoint
ar: نقطة النهاية
ja: エンドポイント

source: Endpoint Content
ar: محتوى نقطة النهاية
ja: エンドポイントのコンテンツ

source: Endpoint Slug
ar: الاسم اللطيف لنقطة النهاية
ja: エンドポイントスラッグ

source: Endpoint content supports shortcodes
ar: محتوى نقطة النهاية يدعم الأكواد القصيرة
ja: エンドポイントのコンテンツはショートコードに対応しています

source: Endpoint slug is required.
ar: الاسم اللطيف لنقطة النهاية مطلوب.
ja: エンドポイントスラッグは必須です。

source: Error saving menu.
ar: خطأ في حفظ القائمة.
ja: メニューの保存中にエラーが発生しました。

source: Export
ar: تصدير
ja: エクスポート

source: HTML or shortcodes for this page (optional)
ar: HTML أو أكواد قصيرة لهذه الصفحة (اختياري)
ja: このページのHTMLまたはショートコード（任意）

source: Hide from Plugins List
ar: إخفاء من قائمة الإضافات
ja: プラグイン一覧から非表示

source: Hides this plugin from the WordPress Plugins page.
ar: يخفي هذه الإضافة من صفحة إضافات ووردبريس.
ja: WordPressのプラグインページからこのプラグインを非表示にします。

source: Icon
ar: أيقونة
ja: アイコン

source: Import
ar: استيراد
ja: インポート

source: Invalid import data.
ar: بيانات استيراد غير صالحة.
ja: 無効なインポートデータです。

source: Label shown on the WooCommerce Settings tab.
ar: التسمية المعروضة في تبويب إعدادات ووكومرس.
ja: WooCommerce設定タブに表示されるラベル。

source: Leave all unchecked = visible to everyone.
ar: اترك الكل بدون تحديد = مرئي للجميع.
ja: すべて未選択 = 全員に表示。

source: Leave roles empty = visible to all
ar: اترك الأدوار فارغة = مرئي للجميع
ja: 権限グループを空にする = 全員に表示

source: Link
ar: رابط
ja: リンク

source: Live Preview
ar: معاينة مباشرة
ja: ライブプレビュー

source: Logout
ar: تسجيل الخروج
ja: ログアウト

source: Menu Builder
ar: منشئ القوائم
ja: メニュービルダー

source: Menu imported successfully!
ar: تم استيراد القائمة بنجاح!
ja: メニューが正常にインポートされました！

source: Menu item title
ar: عنوان عنصر القائمة
ja: メニュー項目のタイトル

source: Menu saved successfully!
ar: تم حفظ القائمة بنجاح!
ja: メニューが正常に保存されました！

source: My Account Menu
ar: قائمة حسابي
ja: マイアカウントメニュー

source: My Account Menu Builder
ar: منشئ قائمة حسابي
ja: マイアカウントメニュービルダー

source: New Tab
ar: تبويب جديد
ja: 新しいタブ

source: No menu items yet. Click "Add Item" to get started.
ar: لا توجد عناصر بعد. انقر على "إضافة عنصر" للبدء.
ja: メニュー項目がありません。「項目を追加」をクリックして始めましょう。

source: None
ar: لا شيء
ja: なし

source: Open In
ar: فتح في
ja: 開く方法

source: Order Count
ar: عدد الطلبات
ja: 注文数

source: Orders
ar: الطلبات
ja: 注文

source: Plugin Name
ar: اسم الإضافة
ja: プラグイン名

source: Quick Tips
ar: نصائح سريعة
ja: クイックヒント

source: Quick pick:
ar: اختيار سريع:
ja: クイック選択：

source: Rebrand this plugin for client projects.
ar: أعد تسمية هذه الإضافة لمشاريع العملاء.
ja: クライアントプロジェクト用にリブランドします。

source: Reset Defaults
ar: إعادة التعيين
ja: デフォルトに戻す

source: Reset menu to WooCommerce defaults? This will discard all customizations.
ar: إعادة تعيين القائمة إلى إعدادات ووكومرس الافتراضية؟ سيتم تجاهل جميع التخصيصات.
ja: WooCommerceのデフォルトにリセットしますか？すべてのカスタマイズが失われます。

source: Same Tab
ar: نفس التبويب
ja: 同じタブ

source: Save Item
ar: حفظ العنصر
ja: 項目を保存

source: Save Menu
ar: حفظ القائمة
ja: メニューを保存

source: Save Permalinks if new endpoints 404
ar: احفظ الروابط الدائمة إذا أعطت نقاط النهاية الجديدة خطأ 404
ja: 新しいエンドポイントが404の場合はパーマリンクを保存してください

source: Save Settings
ar: حفظ الإعدادات
ja: 設定を保存

source: Settings
ar: الإعدادات
ja: 設定

source: Settings Tab Label
ar: تسمية تبويب الإعدادات
ja: 設定タブのラベル

source: Settings saved! Reload to see changes.
ar: تم حفظ الإعدادات! أعد تحميل الصفحة لرؤية التغييرات.
ja: 設定が保存されました！変更を確認するにはリロードしてください。

source: Short description shown below title
ar: وصف قصير يظهر أسفل العنوان
ja: タイトルの下に表示される短い説明

source: Title
ar: العنوان
ja: タイトル

source: Title is required.
ar: العنوان مطلوب.
ja: タイトルは必須です。

source: Type
ar: النوع
ja: タイプ

source: URL
ar: الرابط

source: URL is required for link items.
ar: الرابط مطلوب لعناصر الروابط.
ja: リンク項目にはURLが必須です。

source: URL-friendly slug (lowercase, hyphens). Will appear as /my-account/your-slug/
ar: اسم لطيف متوافق مع الروابط (حروف صغيرة وشرطات). سيظهر كـ /my-account/اسمك/
ja: URL用スラッグ（小文字、ハイフン）。/my-account/スラッグ/ として表示されます

source: Use separators to group items
ar: استخدم الفواصل لتجميع العناصر
ja: 区切り線で項目をグループ化

source: Visible to Roles
ar: مرئي للأدوار
ja: 権限グループの表示設定

source: Welcome to %s.
ar: مرحبًا بك في %s.
ja: %sへようこそ。

source: White Label
ar: العلامة البيضاء
ja: ホワイトラベル

source: White Label Settings
ar: إعدادات العلامة البيضاء
ja: ホワイトラベル設定

source: My Account Menu Builder for WooCommerce
ar: Woo منشئ قائمة حسابي
ja: Woo マイアカウントメニュービルダー

source: WooCommerce is required. Please install and activate WooCommerce.
ar: ووكومرس مطلوب. يرجى تثبيت وتفعيل ووكومرس.
ja: WooCommerceが必要です。WooCommerceをインストールして有効化してください。

source: e.g. New, Pro, Hot
ar: مثال: جديد، احترافي، رائج
ja: 例：新着、Pro、人気

source: my-custom-class
ar: فئة-css-مخصصة
ja: カスタムクラス名
